Documents/РасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИМатериалов</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыдыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьВидимость() 
 	СтрокаТипПолучателя = "";	
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВыдачаДенегПодотчетнику") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.РасчетныйСчет.Видимость = Ложь; 
		Элементы.Получатель.Видимость = Истина;
		Элементы.КассаПолучатель.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВзносНаличнымиВБанк")Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.РасчетныйСчет.Видимость = Истина; 
		Элементы.Получатель.Видимость = Истина;
		Элементы.КассаПолучатель.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Банки";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ПередачаВДругуюКассу") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.Получатель.Видимость = Ложь;
		Элементы.КассаПолучатель.Видимость = Истина;  	
	Иначе
		Элементы.ДоговорКонтрагента.Видимость = Истина;  
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.Получатель.Видимость = Истина;
		Элементы.КассаПолучатель.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда         
        Массив = Новый Массив();
        Массив.Добавить(Тип(СтрокаТипПолучателя));    
        ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
        Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;        
	КонецЕсли; 
	
	Если Элементы.ДоговорКонтрагента.Видимость = Истина
        И ЗначениеЗаполнено(Объект.Получатель) Тогда
        Элементы.ДоговорКонтрагента.Видимость = ВидимостьДоговораКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
    КонецЕсли; 	
   КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВыдачаДенегПодотчетнику")
	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВзносНаличнымиВБанк"))
	И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		ТекстВопроса = "При изменении реквизита ""Вид операции"" на " + Строка(Объект.ВидОперации) + " будут очищены следующие данные:
		| - Договор контрагента
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОпераций",ЭтаФорма,МассивОчищаемыхРеквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе 
		ВидОперации = Объект.ВидОперации;
		УстановитьВидимость();  
	КонецЕсли;
   КонецПроцедуры
   
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОпераций(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        	Объект[Реквизит] = Неопределено;
    	КонецЦикла;
    	УстановитьВидимость();
    	ВидОперации =  Объект.ВидОперации;
	Иначе
   		Объект.ВидОперации = ВидОперации;
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	ЭтоПоставщик = ВидимостьДоговораКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
	МассивОчищаемыхРеквизитов = Новый Массив;
	Если Не ЭтоПоставщик И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		ТекстВопроса = "При изменении реквизита ""Плательщик"" на " + Строка(Объект.Получитель) + " будут очищены следующие данные:
		| - Договор контрагента
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПлательщика",ЭтаФорма,МассивОчищаемыхРеквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе 
		Получатель = Объект.Получатель;
		УстановитьВидимость();  
	КонецЕсли;  
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
